# # # ---------------- BASIC INFO ----------------
# # nc: 1
# # names: ['tree']

# # # ---------------- BACKBONE ------------------
# # backbone:
# #   - [-1, 1, Conv, [3,  16, 3, 2]]     # 0
# #   - [-1, 1, CBAM, [16]]               # 1
# #   - [-1, 1, Conv, [16, 32, 3, 2]]     # 2
# #   - [-1, 1, C2f,  [32, 32, 1]]        # 3
# #   - [-1, 1, Conv, [32, 64, 3, 2]]     # 4
# #   - [-1, 1, CBAM, [64]]               # 5
# #   - [-1, 2, C2f,  [64, 64, 2]]        # 6   (P3)
# #   - [-1, 1, Conv, [64, 128, 3, 2]]    # 7
# #   - [-1, 1, CBAM, [128]]              # 8
# #   - [-1, 2, C2f,  [128, 128, 2]] # 9   (P4)
# #   - [-1, 1, Conv, [128, 256, 3, 2]]   #10
# #   - [-1, 1, C2f,  [256, 256, 1]]      #11   (P5)
# #   - [-1, 1, SPPF, [256, 256]]         #12   (P5 ‑ SPPF)

# # # ---------------- HEAD ----------------------
# # head:
# #   # P5 → P4
# #   - [-1, 1, Conv, [256, 128, 1, 1]]           #13
# #   - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #14
# #   - [[-1,  9], 1, Concat, [1]]                #15  (9=P4)
# #   - [-1, 1, C2f,  [256, 128, 1]]              #16  (P4‑fusion)

# #   # P4‑fusion → P3
# #   - [-1, 1, Conv, [128, 64, 1, 1]]            #17
# #   - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #18
# #   - [[-1,  6], 1, Concat, [1]]                #19  (6=P3)
# #   - [-1, 1, C2f,  [128, 64, 1]]               #20  (P3‑fusion)

# #   # FPN → PAN (down‑sample)
# #   - [-1, 1, Conv, [64,  64, 3, 2]]            # 21
# #   - [[-1, 16], 1, Concat, [1]]                #22  (16=P4‑fusion)
# #   - [-1, 1, C2f,  [192, 128, 1]]              #23

# #   - [-1, 1, Conv, [128, 128, 3, 2]]           #24
# #   - [[-1, 13], 1, Concat, [1]]                #25  (13=P5→P4 conv)
# #   - [-1, 1, C2f,  [256, 256, 1]]              #26

# #   # Detect head (auto‑reads nc=1)
# #   # Detect head
# #   - [[20, 23, 26],  1, Detect, [nc]]

# # Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# # Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# # Model docs: https://docs.ultralytics.com/models/yolov8
# # Task docs: https://docs.ultralytics.com/tasks/detect

# # yolov8n_cbam_fixed.yaml  (핵심 인덱스만 수정, 나머지는 동일)

# nc: 1
# depth_multiple: 0.33
# width_multiple: 0.25
# max_channels: 1024

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]      # 0
#   - [-1, 1, Conv, [128, 3, 2]]     # 1
#   - [-1, 1, CBAM, [32]]            # 2
#   - [-1, 3, C2f, [128, True]]      # 3
#   - [-1, 1, Conv, [256, 3, 2]]     # 4
#   - [-1, 1, CBAM, [64]]            # 5
#   - [-1, 6, C2f, [256, True]]      # 6  (P3, stride 8)
#   - [-1, 1, Conv, [512, 3, 2]]     # 7
#   - [-1, 6, C2f, [512, True]]      # 8  (P4, stride 16)
#   - [-1, 1, Conv, [1024, 3, 2]]    # 9
#   - [-1, 1, CBAM, [256]]           # 10
#   - [-1, 3, C2f, [1024, True]]     # 11
#   - [-1, 1, SPPF, [1024, 5]]       # 12 (P5, stride 32)

# head:
#   # P5 → P4
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13  (stride 32→16)
#   - [[-1, 8], 1, Concat, [1]]                    # 14  **P4(8)로 수정**
#   - [-1, 3, C2f, [512]]                          # 15  (P4‑fusion)

#   # P4‑fusion → P3
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16  (stride 16→8)
#   - [[-1, 6], 1, Concat, [1]]                    # 17  (P3)
#   - [-1, 3, C2f, [256]]                          # 18  (P3‑fusion)

#   # FPN → PAN (down‑sample)
#   - [-1, 1, Conv, [256, 3, 2]]                   # 19  (8→16)
#   - [[-1, 15], 1, Concat, [1]]                   # 20  **P4‑fusion(15)로 수정**
#   - [-1, 3, C2f, [512]]                          # 21  (P4‑PAN)

#   - [-1, 1, Conv, [512, 3, 2]]                   # 22  (16→32)
#   - [[-1, 12], 1, Concat, [1]]                   # 23  (P5)
#   - [-1, 3, C2f, [1024]]                         # 24  (P5‑PAN)

#   # Detect head
#   - [[18, 21, 24], 1, Detect, [nc]]              # P3, P4, P5
# yolov8n_cbam_p2.yaml  ── P2-Head + 4-Scale Detect

# yolov8n_cbam_p2_atthead_fix.yaml
# 4-스케일(P2·P3·P4·P5) + Head-CBAM ×2

# nc: 1
# depth_multiple: 0.33
# width_multiple: 0.25
# max_channels: 1024

# # ---------------- BACKBONE ----------------
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]          # 0 (P1/2)
#   - [-1, 1, Conv, [128, 3, 2]]         # 1 (P2/4)
#   - [-1, 1, CBAM, [32]]                # 2
#   - [-1, 3, C2f, [128, True]]          # 3  ← P2
#   - [-1, 1, Conv, [256, 3, 2]]         # 4
#   - [-1, 1, CBAM, [64]]                # 5
#   - [-1, 6, C2f, [256, True]]          # 6  ← P3
#   - [-1, 1, Conv, [512, 3, 2]]         # 7
#   - [-1, 6, C2f, [512, True]]          # 8  ← P4
#   - [-1, 1, Conv, [1024, 3, 2]]        # 9
#   - [-1, 1, CBAM, [256]]               # 10
#   - [-1, 3, C2f, [1024, True]]         # 11
#   - [-1, 1, SPPF, [1024, 5]]           # 12 ← P5

# # ---------------- HEAD --------------------
# head:
#   # P5 → P4
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
#   - [[-1, 8], 1, Concat, [1]]                    # 14
#   - [-1, 3, C2f, [512]]                          # 15
#   - [-1, 1, CBAM, [128]]                         # 16  ★ Head-CBAM① (P4-fusion)

#   # P4-fusion → P3
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17
#   - [[-1, 6], 1, Concat, [1]]                    # 18
#   - [-1, 3, C2f, [256]]                          # 19
#   - [-1, 1, CBAM, [64]]                         # 20  ★ Head-CBAM② (P3-fusion)

#   # P3-fusion → P2
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 21
#   - [[-1, 3], 1, Concat, [1]]                    # 22
#   - [-1, 3, C2f, [128]]                          # 23  ← P2-fusion

#   # -------- PAN (down-sample) --------
#   - [-1, 1, Conv, [128, 3, 2]]                   # 24
#   - [[-1, 20], 1, Concat, [1]]                   # 25  (P3-fusion after CBAM②)
#   - [-1, 3, C2f, [256]]                          # 26  ← P3-PAN

#   - [-1, 1, Conv, [256, 3, 2]]                   # 27
#   - [[-1, 16], 1, Concat, [1]]                   # 28  (P4-fusion after CBAM①)
#   - [-1, 3, C2f, [512]]                          # 29  ← P4-PAN

#   - [-1, 1, Conv, [512, 3, 2]]                   # 30
#   - [[-1, 12], 1, Concat, [1]]                   # 31  (P5)
#   - [-1, 3, C2f, [1024]]                         # 32  ← P5-PAN

#   # -------- Detect (4-scale) --------
#   - [[23, 26, 29, 32], 1, Detect, [nc]]
# yolov8n_cbam_p2_w33.yaml  ── width_multiple 0.33 + 4-스케일 + CBAM

# yolov8n_cbam_p2_w30.yaml  ── 4 M 아래(≈3.8 M) 설정

# yolov8n_cbam_p2_w29.yaml  ── width_multiple 0.29 + 4-스케일 Detect

# yolov8n_cbam_p2_w285.yaml  ── 총 파라미터 ≈ 3.65 M

nc: 1
depth_multiple: 0.33
width_multiple: 0.285          # ★ 0.285
max_channels: 1024

# ---------- BACKBONE ----------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0
  - [-1, 1, Conv, [128, 3, 2]]         # 1
  - [-1, 1, CBAM, [40]]                # 2   (128×0.285 → 40)
  - [-1, 3, C2f, [128, True]]          # 3
  - [-1, 1, Conv, [256, 3, 2]]         # 4
  - [-1, 1, CBAM, [80]]                # 5   (256×0.285 → 80)
  - [-1, 6, C2f, [256, True]]          # 6
  - [-1, 1, Conv, [512, 3, 2]]         # 7
  - [-1, 6, C2f, [512, True]]          # 8
  - [-1, 1, Conv, [1024, 3, 2]]        # 9
  - [-1, 1, CBAM, [296]]               # 10  (1024×0.285 → 296)
  - [-1, 3, C2f, [1024, True]]         # 11
  - [-1, 1, SPPF, [1024, 5]]           # 12

# ---------- HEAD ----------
head:
  # P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                # 실제 152 ch (512×0.285)
  - [-1, 1, CBAM, [152]]               # CBAM①

  # P4-fusion → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]                # 실제 80 ch
  - [-1, 1, CBAM, [80]]                # CBAM②

  # P3-fusion → P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]                # 실제 40 ch

  # -------- PAN ↓ --------
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 20], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  # -------- Detect (P2, P3, P4, P5) --------
  - [[23, 26, 29, 32], 1, Detect, [nc]]
